{"data":{"site":{"siteMetadata":{"author":{"name":"Ron Chamberlain","contacts":{"twitter":"cstmizd"}},"disqusShortname":"","subtitle":"Ron's musings..","title":"Blog by Ron Chamberlain","url":"https://roncham.github.io"}},"markdownRemark":{"id":"32b9bf97-ebf9-56a8-a921-16f773d62710","html":"<p><img src=\"/media/relax_pexels.jpg\" alt=\"Do Nothing\">\n\nHave you ever spent hours trying to figure out a problem and after you walk away from it or you just give up trying to solve it, then the solution just comes to you?</div></p>\n<p>Or you try to remember a persons name for a long time then suddenly in the middle of the night the names pops into your head.</p>\n<p>Actively working on the problem for hours on end will not help you solve it. Your brain is too active and too easily distracted.</p>\n<p>Sometimes the best solution for solving a problem or just being more productive is to just <strong>walk away and quiet your mind</strong>.</p>\n<p>Take some time every day and just do nothing. Here are a few ways to let your mind wander while you relax and a few things to avoid.</p>\n<ul>\n<li><strong>Take a walk outside</strong> – preferably in a park or in a nature setting.</li>\n<li><strong>Try meditation</strong> – meditation comes in many forms, but the point here is too just empty your mind.</li>\n<li><strong>Try Tai Chi</strong> – this ancient Chinese mind-body practice is perfect for relaxing. Also referred to as “meditation in motion”.</li>\n<li><strong>Yoga</strong> – an ancient Hindu mind-body practice, helps to reduce stress and helps you become calm and centered.</li>\n<li><strong>Do deep breathing exercises</strong> – Breathing deeply helps you calm down and feel more relaxed.</li>\n<li><strong>Get a massage</strong> – There is nothing like a great massage to relax. If money is tight, some massage schools let students work on clients at a discount.</li>\n<li><strong>Listen to a nature sounds CD</strong> while closing your eyes and relaxing, doing yoga or meditating.</li>\n</ul>\n<p>The mind cannot relax and come up with solutions if you are keeping it busy doing something else.</p>\n<ul>\n<li><strong>Avoid reading</strong></li>\n<li><strong>Avoid the television</strong></li>\n<li><strong>Avoid the radio or loud music</strong></li>\n</ul>\n<p>Do whatever it takes to help you to relax your mind and you will increase your productivity.</p>\n<p><strong>How do you relax your mind?</strong></p>\n<p><small><em>Originally posted by me <a href=\"http://www.pegasusteam.com/do-nothing-to-be-more-productive/\">here</a></em></small></p>","fields":{"slug":"/posts/do-nothing-and-be-more-productive/","tagSlugs":["/tag/productivity/"]},"frontmatter":{"date":"2015-04-28","description":"Sometimes the best solution for solving a problem or just being more productive is to just walk away and quiet your mind. Take some time every day and just do nothing. Here are a few ways to...","tags":["Productivity"],"title":"Do Nothing, And Be More Productive"}}},"pageContext":{"slug":"/posts/do-nothing-and-be-more-productive/"}}